<template>
	<view class="agree" style="width:90%;margin:20px auto;padding-bottom: 40px;"><mp-html :content="text"></mp-html></view>
</template>

<script>
export default {
	data() {
		return {
			text:''
		}
	},
	onLoad(options){
		if(options.text == 1){
			this.text = `<div>软件使用协议</div>`
		}else if(options.text==2){
			this.text = `<div>用户隐私协议</div>`
		}else{
			this.text ="<div><div contenteditable='true' style='width:100%; height:100%;' class='w-e-text' > <p style='line-height:2;font-size:14px;'><b>一、用户协议总则</b><br><font color='#666' >1、本协议双方为</font><br>甲方：牙小新口腔营销助手入驻用户(以下简称甲方)<br>乙方：中齿集团 (以下简称乙方)<br>2、甲方在注册前请仔细阅读本协议的条款，并按照页面上的提示完成全部注册程序。<br>3、甲方在进行注册过程中点击“同意”按钮，即表示已充分知悉和完全接受本协议项下全部条款，进而与乙方达成本协议。<br>4、乙方小程序有权不时对本协议项下相关规则作出修改或补充，并于公布。甲方若继续使用即视为接受修订后的本协议条款。<br><b>二、甲方的权利与义务</b><br>1、甲方拥有对本协议中的牙小新微信小程序的使用权;<br>2、甲方严格在乙方许可下使用本协议中的牙小新微信小程序，保证不在本协议约定的牙小新微信小程序的任何基础上以发展任何派生版本、修改版本或第三方版本等行为;<br>3、甲方明确承诺对本合同的价款保密;<br>4、按照合同的约定，及时支付费用。如因乙方过错未能如期完成合同约定内容，甲方有权要求终止，要求乙方退还相应款项;<br>5、甲方应保证其推广信息及其链接的微信小程序等全部内容符合国家有关法律法规及中华人民共和国承认或加入的国际条约的规定，符合乙方产品政策或服务功能的要求，不侵犯第三方的合法权益(包括但不限于知识产权、商业秘密、技术秘密、隐私权、肖像权、人格权等);<br>6、甲方需保证提供开通牙小新的资质真实有效，需保证展示的医生资料真实有效，并向乙方提供相关资质，如因此给乙方造成损失的，应由甲方承担全部责任;<br>7、甲方需严格按照《中华人民共和国广告法》相关法律法规发布广告，不得使用违反《中华人民共和国广告法》相关违禁词，不得转载不限于明确规定禁止转载、涉及政治言论、造谣迷信等类文章，如因此给乙方造成损失的，应由甲方承担全部责任。<br><b>三、乙方的权利及义务</b><br>1、乙方授权甲方使用本协议中的牙小新微信小程序工具，仅限于甲方使用;<br>2、在服务期限内，乙方在给甲方提供包括电话、即时通讯工具等方式的服务与技术支持;<br>3、乙方必须保证提供的牙小新微信小程序是官方正版;<br>4、乙方有义务在甲方首次购买产品时为其操作人员进行推广工具操作培训;<br>5、乙方对涉及到甲方的数据严格保密;<br>6、乙方负责定期对本协议中的牙小新微信小程序升级，保证牙小新微信小程序的有效性和生命力;<br>7、乙方不向其他任何第三方保证和承诺甲方推广信息及其链接的网站内容的真实性和合法性，甲方自行对其推广信息和网站内容、产品、服务等承担全部法律责任;<br><b>四、甲方隐私保护</b><br>乙方小程序将严格履行甲方隐私保密义务，承诺不公开、不透露甲方信息，但以下特殊情况除外：<br>1、经甲方事先许可授权;<br>2、遵守国家法律法规或配合相关政府部门的要求;<br>3、遵从乙方小程序合法服务程序;<br>4、为维护社会公众利益以及乙方小程序的合法权益所必须。<br><b>五、乙方协议内容的变更和修订</b><br>1、乙方有权在必要时修改服务条款，修改后的协议可以在乙方软件上查看。<br>2、甲方如果不同意乙方所改动的内容，可自行停止使用乙方程序服务。<br>3、如果甲方继续享用乙方服务，则视为同意接受乙方服务条款的变动。<br>4、乙方可随时根据实际情况中断或终止一项或多项服务而无需对任何甲方或第三方承担任何责任，如甲方对一项或多项网络服务的中断或终止有异议，可以行使如下权利：<br>(1) 自行停止使用乙方小程序的服务。<br>(2) 通知乙方停止对其的服务。结束服务后，甲方使用小程序的权利立即终止，从终止时起，甲方没有权利再进行处理任何未完成的信息或服务，乙方也没有义务为其传送任何未处理的信息或未完成的服务给甲方或任何第三方。<br><b>六、免责条款</b><br>1、由于不可抗力、意外事件或第三方原因而影响乙方正常的服务和技术支持时，不视为乙方违约，甲方对此表示认同。<br>2、由于乙方对平台进行系统测试、升级、更新、服务抽样测试，对甲方产生的任何影响乙方可免于承担责任。<br><b>七、违约责任</b><br>1、甲方应按照合同约定，及时向乙方付清合同价款，逾期支付的，则每逾期一日，甲方每日按应付款项的10%向乙方支付违约金，逾期十个工作日以上的，乙方有权单方终止本合同。<br>2、本产品一经销售不能退款，因本合同产生的任何形式的续费同样适用本解除条款的约定。<br>3、本合同其他条款对违约有其他约定的，从其约定。<br><b>八、争议解决</b><br>双方在合同履行过程中发生争议的，应当协商解决。协商不成的，任何一方有权向乙方所在地人民法院提起诉讼。</p></div></div>"
		}
	}
}
</script>

<style></style>
